<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7c94ff0b4537bcea949dc000f42b1d4a58c98dc16775c7df7dce946802eb0f9f","plan_job_ref":"Job Terraform plan #28 at https://github.com/fvst-dev/fvst-monorepo/actions/runs/5842049798","plan_hash":"65c9acc3ef8081032b3db853a33bd709798c5b07c0413a6e02b3473d43a46c53","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __./infra/envs/staging__
<details>
<summary>Plan: 16 to add, 0 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.graphql-gateway.data.google_iam_policy.cloud_run_invoker_policy will be read during apply
  # (config refers to values not yet known)
 <= data "google_iam_policy" "cloud_run_invoker_policy" {
      + id          = (known after apply)
      + policy_data = (known after apply)

      + binding {
          + members = [
              + (known after apply),
            ]
          + role    = "roles/run.invoker"
        }
    }

  # module.graphql-gateway.google_cloud_run_service_iam_policy.access_to_service["blog"] will be created
  + resource "google_cloud_run_service_iam_policy" "access_to_service" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = (known after apply)
      + project     = "reede-kodus-1-fvst-staging"
      + service     = "blog-graphql"
    }

  # module.graphql-gateway.google_cloud_run_service_iam_policy.access_to_service["todo"] will be created
  + resource "google_cloud_run_service_iam_policy" "access_to_service" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = (known after apply)
      + project     = "reede-kodus-1-fvst-staging"
      + service     = "todo-graphql"
    }

  # module.graphql-gateway.google_cloud_run_service_iam_policy.access_to_service["user"] will be created
  + resource "google_cloud_run_service_iam_policy" "access_to_service" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + location    = "europe-west1"
      + policy_data = (known after apply)
      + project     = "reede-kodus-1-fvst-staging"
      + service     = "user-graphql"
    }

  # module.graphql-gateway.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id  = "******************"
      + description = "graphql-gateway SA"
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.web.google_project_iam_member.secret_manager_binding will be created
  + resource "google_project_iam_member" "secret_manager_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "reede-kodus-1-fvst-staging"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.web.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id  = "******"
      + description = "web SA"
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.blog-graphql.module.service.google_cloud_run_service.default is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "default" {
      ~ id                         = "**********************************************************************************" -> (known after apply)
        name                       = "blog-graphql"
      ~ project                    = "reede-kodus-1-fvst-staging" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Revision 'blog-graphql-00001-j8w' is not ready and cannot serve traffic. Image 'us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/blog-graphql:latest' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "Revision 'blog-graphql-00001-j8w' is not ready and cannot serve traffic. Image 'us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/blog-graphql:latest' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "blog-graphql-00001-j8w"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      - metadata {
          - annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "************************************"
              - "serving.knative.dev/creator"       = "peeter@fvst.dev"
              - "serving.knative.dev/lastModifier"  = "peeter@fvst.dev"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
            } -> null
          - namespace        = "reede-kodus-1-fvst-staging" -> null
          - resource_version = "AAYCuz9ulXk" -> null
          - self_link        = "/apis/serving.knative.dev/v1/namespaces/200831240314/services/blog-graphql" -> null
          - uid              = "ddd7d791-5c70-46f9-b200-338aa0accd67" -> null
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale"         = "100" -> null
                    # (2 unchanged elements hidden)
                }
              ~ generation       = 0 -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/blog-graphql:latest" -> "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/blog-graphql:"
                  + name    = (known after apply)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  ~ resources {
                      - requests = {} -> null
                        # (1 unchanged attribute hidden)
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }

                    # (4 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.graphql-gateway.module.service.google_cloud_run_service.default will be created
  + resource "google_cloud_run_service" "default" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "graphql-gateway"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/execution-environment" = "gen2"
                }
              + generation       = (known after apply)
              + labels           = {
                  + "run.googleapis.com/startupProbeType" = "Default"
                }
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/graphql-gateway:"
                  + name  = (known after apply)

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.todo-graphql.module.service.google_cloud_run_service.default is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "default" {
      ~ id                         = "**********************************************************************************" -> (known after apply)
        name                       = "todo-graphql"
      ~ project                    = "reede-kodus-1-fvst-staging" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Revision 'todo-graphql-00001-rbz' is not ready and cannot serve traffic. Image 'us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/todo-graphql:latest' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "Revision 'todo-graphql-00001-rbz' is not ready and cannot serve traffic. Image 'us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/todo-graphql:latest' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "todo-graphql-00001-rbz"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      - metadata {
          - annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "************************************"
              - "serving.knative.dev/creator"       = "peeter@fvst.dev"
              - "serving.knative.dev/lastModifier"  = "peeter@fvst.dev"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
            } -> null
          - namespace        = "reede-kodus-1-fvst-staging" -> null
          - resource_version = "AAYCuz9ucQw" -> null
          - self_link        = "/apis/serving.knative.dev/v1/namespaces/200831240314/services/todo-graphql" -> null
          - uid              = "9b208961-a7e4-49b8-9448-49b877bea328" -> null
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale"         = "100" -> null
                    # (2 unchanged elements hidden)
                }
              ~ generation       = 0 -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/todo-graphql:latest" -> "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/todo-graphql:"
                  + name    = (known after apply)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  ~ resources {
                      - requests = {} -> null
                        # (1 unchanged attribute hidden)
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }

                    # (4 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.user-graphql.module.service.google_cloud_run_service.default is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "default" {
      ~ id                         = "**********************************************************************************" -> (known after apply)
        name                       = "user-graphql"
      ~ project                    = "reede-kodus-1-fvst-staging" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = "Revision 'user-graphql-00001-zdc' is not ready and cannot serve traffic. Image 'us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/user-graphql:latest' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = "Revision 'user-graphql-00001-zdc' is not ready and cannot serve traffic. Image 'us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/user-graphql:latest' not found."
                      - reason  = "RevisionFailed"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "user-graphql-00001-zdc"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      - metadata {
          - annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "************************************"
              - "serving.knative.dev/creator"       = "peeter@fvst.dev"
              - "serving.knative.dev/lastModifier"  = "peeter@fvst.dev"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
            } -> null
          - namespace        = "reede-kodus-1-fvst-staging" -> null
          - resource_version = "AAYCuz9uoMQ" -> null
          - self_link        = "/apis/serving.knative.dev/v1/namespaces/200831240314/services/user-graphql" -> null
          - uid              = "2556caaa-0100-45d4-9809-689bbb5a281b" -> null
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale"         = "100" -> null
                    # (2 unchanged elements hidden)
                }
              ~ generation       = 0 -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  ~ image   = "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/user-graphql:latest" -> "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/user-graphql:"
                  + name    = (known after apply)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  ~ resources {
                      - requests = {} -> null
                        # (1 unchanged attribute hidden)
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }

                    # (4 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.web.module.clerk_publishable_key.data.google_secret_manager_secret_version.secret_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "secret_data" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + secret       = "clerk_publishable_key"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.module.clerk_publishable_key.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "*********************"

      + replication {
          + automatic = true
        }
    }

  # module.web.module.clerk_publishable_key.google_secret_manager_secret_version.secret_version will be created
  + resource "google_secret_manager_secret_version" "secret_version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.module.clerk_secret_key.data.google_secret_manager_secret_version.secret_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_secret_manager_secret_version" "secret_data" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + secret       = "clerk_secret_key"
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.module.clerk_secret_key.google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "****************"

      + replication {
          + automatic = true
        }
    }

  # module.web.module.clerk_secret_key.google_secret_manager_secret_version.secret_version will be created
  + resource "google_secret_manager_secret_version" "secret_version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

  # module.web.module.service.google_cloud_run_service.default will be created
  + resource "google_cloud_run_service" "default" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "web"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/execution-environment" = "gen2"
                }
              + generation       = (known after apply)
              + labels           = {
                  + "run.googleapis.com/startupProbeType" = "Default"
                }
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-docker.pkg.dev/reede-kodus-1-fvst-staging/registry/web:"
                  + name  = (known after apply)

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.web.module.service.google_cloud_run_service_iam_member.public_access[0] will be created
  + resource "google_cloud_run_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "web"
    }

Plan: 16 to add, 0 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #28](https://github.com/fvst-dev/fvst-monorepo/actions/runs/5842049798)